


<center> <H1> <b>Data Analysis with Python </b><figure> </H1> </center>
<center> <H6>  </H6> </center>

# Arithmetic Operations in Pandas

In [1]:
import pandas as pd 
import numpy as np

In [2]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [3]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [4]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [5]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["Tim","Tom"])
df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["Tim","Kate","Tom"])

In [6]:
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [7]:
df1+df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [8]:
df1.add(df2,fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [9]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [10]:
df1

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [11]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [12]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [13]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [14]:
s=df2.iloc[1]
s

A    3
C    4
D    5
Name: Kate, dtype: int32

In [15]:
df2-s

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [16]:
s2=df2["A"]
s2

Tim     0
Kate    3
Tom     6
Name: A, dtype: int32

In [29]:
df2.sub(s2,axis="rows") #index

      A  C  D
Tim   0  1  2
Kate  0  1  2
Tom   0  1  2

In [30]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

## Applying a Function

In [39]:
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"])
df

              A         B         C
Kim   -0.651932  3.246655 -0.969627
Susan -0.121741 -0.091458  0.381772
Tim    0.845105 -0.277001  0.938544
Tom    1.649176  0.742867 -0.486301

In [40]:
np.abs(df)

              A         B         C
Kim    0.651932  3.246655  0.969627
Susan  0.121741  0.091458  0.381772
Tim    0.845105  0.277001  0.938544
Tom    1.649176  0.742867  0.486301

In [41]:
f=lambda x:x.max()-x.min()

In [42]:
df.apply(f,axis=0)

A    2.301107
B    3.523656
C    1.908171
dtype: float64

In [43]:
df.apply(f,axis=1)

Kim      4.216282
Susan    0.503513
Tim      1.215545
Tom      2.135477
dtype: float64

In [46]:
def f(x):
    return x**2

In [45]:
df.apply(f)

              A          B         C
Kim    0.425015  10.540770  0.940177
Susan  0.014821   0.008365  0.145750
Tim    0.714202   0.076730  0.880864
Tom    2.719781   0.551852  0.236489